Catalogs/ДМ_КаталогиДляРаботыСФайлами.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Catalog>
		<Properties>
			<Name>ДМ_КаталогиДляРаботыСФайлами</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КаталогФайловДляОбработки</Name>
					<Comment>Путь к каталогу с файлами для выполнения обработки</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаскаФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КаталогАрхиваОбработанныхФайлов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Кодировка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ДМ_КаталогиДляРаботыСФайлами/Ext/ObjectModule.bsl
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если Не ПустаяСтрока( КаталогФайловДляОбработки ) Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДМ_КаталогиДляРаботыСФайлами.Ссылка КАК Ссылка,
		|	ДМ_КаталогиДляРаботыСФайлами.Код КАК Код,
		|	ДМ_КаталогиДляРаботыСФайлами.Наименование КАК Наименование,
		|	ДМ_КаталогиДляРаботыСФайлами.КаталогФайловДляОбработки КАК КаталогФайловДляОбработки,
		|	ДМ_КаталогиДляРаботыСФайлами.МаскаФайла КАК МаскаФайла,
		|	ДМ_КаталогиДляРаботыСФайлами.КаталогАрхиваОбработанныхФайлов КАК КаталогАрхиваОбработанныхФайлов,
		|	ДМ_КаталогиДляРаботыСФайлами.Предопределенный КАК Предопределенный,
		|	ДМ_КаталогиДляРаботыСФайлами.ИмяПредопределенныхДанных КАК ИмяПредопределенныхДанных
		|ИЗ
		|	Справочник.ДМ_КаталогиДляРаботыСФайлами КАК ДМ_КаталогиДляРаботыСФайлами
		|ГДЕ
		|	ДМ_КаталогиДляРаботыСФайлами.КаталогФайловДляОбработки = &КаталогФайловДляОбработки
		|	И (ДМ_КаталогиДляРаботыСФайлами.МаскаФайла = &МаскаФайла
		|			ИЛИ &ПустаяМаскаФайла)
		|	И ДМ_КаталогиДляРаботыСФайлами.Ссылка <> &Ссылка";
		
		Запрос.Параметры.Вставить("КаталогФайловДляОбработки", СокрЛП(КаталогФайловДляОбработки) );
		Запрос.Параметры.Вставить("МаскаФайла", МаскаФайла);
		Запрос.Параметры.Вставить("ПустаяМаскаФайла", ПустаяСтрока( МаскаФайла ));
		Запрос.Параметры.Вставить("Ссылка", Ссылка);
		
		мВК = Новый Массив;
		мВК.Добавить(Справочники.ДМ_КаталогиДляРаботыСФайлами.ВнутреннееПеремещение);
		мВК.Добавить(Справочники.ДМ_КаталогиДляРаботыСФайлами.Клиент);
		
		мВК2 = Новый Массив;
		мВК2.Добавить(Справочники.ДМ_КаталогиДляРаботыСФайлами.ГашениеВСД);
		мВК2.Добавить(Справочники.ДМ_КаталогиДляРаботыСФайлами.Производство);
		
		ВыбЗапрВК = Запрос.Выполнить().Выбрать();
		Если ВыбЗапрВК.Следующий() Тогда
			Если (мВК.Найти(Ссылка) <> Неопределено И мВК.Найти(ВыбЗапрВК.Ссылка) <> Неопределено)
				ИЛИ (мВК2.Найти(Ссылка) <> Неопределено И мВК2.Найти(ВыбЗапрВК.Ссылка) <> Неопределено) Тогда
			Иначе
				//разрешены одинаковый каталог и маска для внутренних перемещений и клиентских отгрузок
				лТекстСообщения = НСтр("ru = 'Каталог %1 и маска для файлов %2 уже указаны в другом элементе справочника'");
				лТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку( лТекстСообщения, СокрЛП(КаталогФайловДляОбработки), СокрЛП(МаскаФайла) );
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю( лТекстСообщения );
				Отказ = Истина;
				Возврат;
			КонецЕсли;
		КонецЕсли;
		
		Если НЕ Справочники.ДМ_КаталогиДляРаботыСФайлами.КаталогОбрабатываемыхФайловДоступен( КаталогФайловДляОбработки ) Тогда
			Отказ = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
	Если Не ПустаяСтрока( КаталогАрхиваОбработанныхФайлов ) Тогда
		
		Если Не Справочники.ДМ_КаталогиДляРаботыСФайлами.КаталогАрхиваОбработанныхФайловДоступен( КаталогАрхиваОбработанныхФайлов ) Тогда
			Отказ = Истина;
		КонецЕсли;
	
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	КаталогФайловДляОбработки		= СокрЛП( КаталогФайловДляОбработки );
	МаскаФайла						= СокрЛП( МаскаФайла );
	КаталогАрхиваОбработанныхФайлов = СокрЛП( КаталогАрхиваОбработанныхФайлов );
	
КонецПроцедуры
